class script(object):
    START_TXT = """<b>ʜᴇʏ, {}! {}</b>
<b>ɪ'ᴍ ᴀ ᴘᴏᴡᴇʀғᴜʟ ᴍᴜsɪᴄ ᴅᴏᴡɴʟᴏᴀᴅᴇʀ ʙᴏᴛ 🎵</b>
<b>ɪ ᴄᴀɴ ᴅᴏᴡɴʟᴏᴀᴅ sᴏɴɢs ғʀᴏᴍ ʏᴏᴜʀ ʟɪɴᴋs 🎧</b>
<b>ᴊᴜsᴛ sᴇɴᴅ ᴍᴇ ᴀ sᴏɴɢ ʟɪɴᴋ ᴏʀ ɴᴀᴍᴇ — ᴀɴᴅ ɢᴇᴛ ʏᴏᴜʀ ᴍᴜsɪᴄ 📥</b>"""

    GSTART_TXT = """<b>ʜᴇʏ, {}! {}</b>
<b>ɪ'ᴍ ᴀ ғᴀsᴛ & sᴍᴀʀᴛ ᴍᴜsɪᴄ ᴅᴏᴡɴʟᴏᴀᴅᴇʀ ʙᴏᴛ 🤖</b>
<b>ᴅᴏᴡɴʟᴏᴀᴅ sᴏɴɢs ɪɴ sᴇᴄᴏɴᴅs 💎</b>
<b>ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴏʀ sᴇɴᴅ ᴀ sᴏɴɢ ʟɪɴᴋ ᴛᴏ sᴛᴀʀᴛ 🎶</b>"""

    HELP_TXT = """<b>
✨ ʜᴏᴡ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴜsɪᴄ ✨
1️⃣ sᴇɴᴅ ᴀ sᴏɴɢ ʟɪɴᴋ ᴏʀ ɴᴀᴍᴇ 🔎
2️⃣ ᴡᴀɪᴛ ғᴏʀ ᴘʀᴏᴄᴇssɪɴɢ ⏳
3️⃣ ɢᴇᴛ ʏᴏᴜʀ sᴏɴɢ ғɪʟᴇ 🎵

📌 ғᴇᴀᴛᴜʀᴇs:
➤ ғᴀsᴛ ᴍᴜsɪᴄ ᴅᴏᴡɴʟᴏᴀᴅ ⚡
➤ ʜɪɢʜ ǫᴜᴀʟɪᴛʏ ᴀᴜᴅɪᴏ 🎧
➤ ᴍᴜʟᴛɪᴘʟᴇ ᴘʟᴀᴛғᴏʀᴍ sᴜᴘᴘᴏʀᴛ 🌍
➤ ᴅɪʀᴇᴄᴛ ᴀᴜᴅɪᴏ ғɪʟᴇ ᴅᴇʟɪᴠᴇʀʏ 🚀

🚀 sᴛᴀʀᴛ ɴᴏᴡ!
</b>"""

    ABOUT_TXT = """<b>╭────[ ᴍʏ ᴅᴇᴛᴀɪʟs ]────⍟
├⍟ Mʏ Nᴀᴍᴇ : <a href=https://t.me/{}>{}</a>
├⍟ Dᴇᴠᴇʟᴏᴘᴇʀ : <a href=https://t.me/Venuboyy>@Venuboyy</a>
├⍟ Lɪʙʀᴀʀʏ : <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ</a>
├⍟ Lᴀɴɢᴜᴀɢᴇ : <a href='https://www.python.org/'>ᴘʏᴛʜᴏɴ 𝟹</a>
├⍟ Dᴀᴛᴀʙᴀsᴇ : <a href='https://www.mongodb.com/'>ᴍᴏɴɢᴏ ᴅʙ</a>
├⍟ Bᴏᴛ Sᴇʀᴠᴇʀ : <a href='https://heroku.com/'>ʜᴇʀᴏᴋᴜ</a>
├⍟ Fᴇᴀᴛᴜʀᴇ : ᴍᴜsɪᴄ ᴅᴏᴡɴʟᴏᴀᴅᴇʀ 🎵
├⍟ Bᴜɪʟᴅ Sᴛᴀᴛᴜs : ᴠ1.0 [ ꜱᴛᴀʙʟᴇ ]
╰───────────────⍟</b>"""

    FORCE_SUB_TXT = """<b>❗ ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ᴊᴏɪɴ ᴏᴜʀ ᴄʜᴀɴɴᴇʟs ᴛᴏ ᴜsᴇ ᴛʜɪs ʙᴏᴛ!

ᴘʟᴇᴀsᴇ ᴊᴏɪɴ ᴀʟʟ ᴄʜᴀɴɴᴇʟs ʙᴇʟᴏᴡ ᴀɴᴅ ᴄʟɪᴄᴋ ✅ ᴠᴇʀɪғʏ.</b>"""

    STATS_TXT = """<b>📊 ʙᴏᴛ sᴛᴀᴛɪsᴛɪᴄs

👥 ᴛᴏᴛᴀʟ ᴜsᴇʀs: {}
🗓️ ᴛᴏᴅᴀʏ's ɴᴇᴡ ᴜsᴇʀs: {}
🕐 ʟᴀsᴛ ᴜᴘᴅᴀᴛᴇᴅ: ʀᴇᴀʟ ᴛɪᴍᴇ</b>"""

    BROADCAST_TXT = """<b>📢 ʙʀᴏᴀᴅᴄᴀsᴛ

✅ sᴇɴᴛ: {}
❌ ғᴀɪʟᴇᴅ: {}
👥 ᴛᴏᴛᴀʟ: {}</b>"""

    INFO_TXT = """<b>
➲Fɪʀsᴛ Nᴀᴍᴇ: {}
➲Lᴀsᴛ Nᴀᴍᴇ: {}
➲Tᴇʟᴇɢʀᴀᴍ ID: {}

➲Dᴀᴛᴀ Cᴇɴᴛʀᴇ: {}

➲Uꜱᴇʀ Nᴀᴍᴇ: {}
➲Uꜱᴇʀ 𝖫𝗂𝗇𝗄: <a href="tg://user?id={}">Cʟɪᴄᴋ Hᴇʀᴇ</a>
</b>"""
